-- -*- M2-comint -*- hash: 581031747

i1 : lexsegmentIdeal (QQ[x_1..x_4], {1,2,3,3,3,3})

                     3
o1 = ideal (x , x , x )
             1   2   3

o1 : Ideal of QQ[x , x , x , x ]
                  1   2   3   4

i2 : almostLexIdeal (QQ[x_1..x_5], {1,3,6,9,12,15})

                     3
o2 = ideal (x , x , x )
             1   2   3

o2 : Ideal of QQ[x , x , x , x , x ]
                  1   2   3   4   5

i3 : lexsegmentIdeal (QQ[x_1..x_4], {1,2,3,3,3,3,0})

                     3   2 4     5   6
o3 = ideal (x , x , x , x x , x x , x )
             1   2   3   3 4   3 4   4

o3 : Ideal of QQ[x , x , x , x ]
                  1   2   3   4

i4 : almostLexIdeal (QQ[x_1..x_5], {1,3,6,9,12,15,15})

                     3   2 4     5   6
o4 = ideal (x , x , x , x x , x x , x )
             1   2   3   3 4   3 4   4

o4 : Ideal of QQ[x , x , x , x , x ]
                  1   2   3   4   5

i5 : lexsegmentIdeal (QQ[x_1..x_5], {1,5,15,35})

o5 = ideal 0

o5 : Ideal of QQ[x , x , x , x , x ]
                  1   2   3   4   5

i6 : almostLexIdeal (QQ[x_1..x_6], {1,6,21,56})

o6 = ideal 0

o6 : Ideal of QQ[x , x , x , x , x , x ]
                  1   2   3   4   5   6

i7 : 
